     C* Variable Declaration
     D string          S             30A   INZ('Mango')
     D pos             S              3S 0

     C* Mainline Calculation

     C* SCAN
     C     'a'           SCAN      string        pos
     C     pos           DSPLY
     C                   SETON                                        LR
